IDEA Open Model
ReinfBarOnMoreEdges Properties
The ReinfBarOnMoreEdges type exposes the following members.
Properties
Name | Description
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Covers
 Covers
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
LengthFromFirstIntersection
 Length of bar from first intersection in the direction of edge
LengthFromLastIntersection
 Length of bar from last intersection in the direction of edge
MasterComponent
 Master component of reinforcement
MasterEdges
 Master Edges
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
WholeFirstEdge
 Bar is on whole length of first edge
WholeLastEdge
 Bar is on whole length of last edge
Top
See Also
Reference
ReinfBarOnMoreEdges Class
IdeaRS.OpenModel.Detail Namespace